<?php
$_['module_picture_transform'] = 'w';

// mime-types
$_['module_picture_formats'] = [
	// jd todo Підтримка png / jp2 / webp / jpg
//        'webp' =>   'image/webp', // jd todo Підтримка webp
	'jpg'  =>   'image/jpeg',
//        'png',
];
$_['module_picture_width_set'] = [
	// jd todo Зараз ширини взяті із масиву мобільних емуляторів інструиентів розробника Chrome, тут можна підібрати масив ширин
	// Рекомендовані розміри оригіналів зображень для банерів 3840*1200 для книжкової орієнтації і 2160*3040 для альбомної
	360,
	375,
	415,
	540,
	650,
	768,
	823,
	1024,
	1280,   // HD       720p    -   1280*720    16:9
	1920,   // FullHD   1080p   -   1920*1080   16:9
	//3840    // 4K UHD   2160p   -   3840*2160   16:9  /* 2х зображення генерується автоматично */
];